# series and dataframe

In [1]:
import numpy as np
import pandas as pd

In [2]:
x = ["12","23","34","45","56"]
df1 = pd.Series(data = x,index=["a","b","c","d","e"])
df1

a    12
b    23
c    34
d    45
e    56
dtype: object

In [3]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y = pd.DataFrame(data = x,index =["a","b","c","d"])
y

    name  age location
a    ram   12     hill
b  shyam   23     park
c    tom   34   avenue
d  jerry   21     rose

In [4]:
x["name"]

['ram', 'shyam', 'tom', 'jerry']

In [5]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y = pd.DataFrame(data = x,index =["a","b","c","d"])
y

    name  age location
a    ram   12     hill
b  shyam   23     park
c    tom   34   avenue
d  jerry   21     rose

# setindex

In [6]:
df2= y.set_index("location",inplace = True)
print(df2)

None

In [7]:
x = ["12","23","34","45","56"]
y = pd.DataFrame()

In [8]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y = pd.DataFrame(data = x,index =["a","b","c","d"])
print(y)

    name  age location
a    ram   12     hill
b  shyam   23     park
c    tom   34   avenue
d  jerry   21     rose

In [9]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y.set_index("name",inplace = True)
print(y)

       age location
name
ram     12     hill
shyam   23     park
tom     34   avenue
jerry   21     rose

In [10]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y = pd.DataFrame(data = x,index =pd.RangeIndex(4,8,1))
print(y)

    name  age location
4    ram   12     hill
5  shyam   23     park
6    tom   34   avenue
7  jerry   21     rose

# renaming  and resetting

In [11]:
x = ["hello","shello","tello","chello"]
df2 = pd.DataFrame(data = x)
X=df2.rename(index={0:"A",1:"B",2:"C",3:"D"})
X

        0
A   hello
B  shello
C   tello
D  chello

In [12]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y = pd.DataFrame(data = x)
Z =y.rename(index={0:"A",1:"B",2:"C",3:"D"})
Z

    name  age location
A    ram   12     hill
B  shyam   23     park
C    tom   34   avenue
D  jerry   21     rose

In [13]:
z = Z.reset_index(inplace = True)
print(z)

None

In [14]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y = pd.DataFrame(data = x)
y.iloc[2]

name           tom
age             34
location    avenue
Name: 2, dtype: object

In [15]:
x = pd.array([12,23,34,45])
y = pd.Series(data = x,index= ["a","b","c","d"])
y

a    12
b    23
c    34
d    45
dtype: Int64

In [16]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y = pd.DataFrame(data = x)
city = ["delhi","goa","uk","berlin"]
y["city"] = city
y

    name  age location    city
0    ram   12     hill   delhi
1  shyam   23     park     goa
2    tom   34   avenue      uk
3  jerry   21     rose  berlin

# delete value(loc,iloc)

In [19]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y = pd.DataFrame(data = x)
y.drop(2,axis =0)

    name  age location
0    ram   12     hill
1  shyam   23     park
3  jerry   21     rose

In [20]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y = pd.DataFrame(data=x)
y.drop(1,axis=0)

    name  age location
0    ram   12     hill
2    tom   34   avenue
3  jerry   21     rose

In [21]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y= pd.Series(x)
y
y.drop("age")

name          [ram, shyam, tom, jerry]
location    [hill, park, avenue, rose]
dtype: object

In [30]:
y.loc[1:3]

    name  age location
1  shyam   23     park
2    tom   34   avenue
3  jerry   21     rose

In [29]:
y.loc[1::]

    name  age location
1  shyam   23     park
2    tom   34   avenue
3  jerry   21     rose

In [31]:
y.loc[:,["name","age"]]

    name  age
0    ram   12
1  shyam   23
2    tom   34
3  jerry   21

In [ ]:
y.iloc[3]

name        jerry
age            21
location     rose
Name: 3, dtype: object

In [ ]:
y.iloc[::1]

    name  age location
0    ram   12     hill
1  shyam   23     park
2    tom   34   avenue
3  jerry   21     rose

In [28]:
y.iloc[1::]

    name  age location
1  shyam   23     park
2    tom   34   avenue
3  jerry   21     rose

In [27]:
y.iloc[:2:]

    name  age location
0    ram   12     hill
1  shyam   23     park

In [26]:
x = {"name":["ram","shyam","tom","jerry"],
     "age":[12,23,34,21],
     "location":["hill","park","avenue","rose"]
    }
y= pd.DataFrame(x)
y

    name  age location
0    ram   12     hill
1  shyam   23     park
2    tom   34   avenue
3  jerry   21     rose

# masking

In [32]:
mask =y["age"]>22
mask

0    False
1     True
2     True
3    False
Name: age, dtype: bool

In [33]:
y[mask]

    name  age location
1  shyam   23     park
2    tom   34   avenue

In [34]:
y[(mask)|(y["name"])]

    name  age location
0    ram   12     hill
1  shyam   23     park
2    tom   34   avenue
3  jerry   21     rose

In [35]:
y[(mask)&(y["name"])]

    name  age location
1  shyam   23     park
2    tom   34   avenue

# data analysing

In [36]:
data = {
    "Continent": ["North America", "Europe", "Asia", "North America", "Asia", "Europe", "North America", "Asia", "Europe", "Asia"],
    "Country": ["United States", "Germany", "China", "Canada", "Japan", "France", "Mexico", "India", "United Kingdom", "Nepal"],
    "Population": [331002651, 83783942, 1439323776, 37742154, 126476461, 65273511, 128932753, 1380004385, 67886011, 29136808]
}
df = pd.DataFrame(data)
df

       Continent         Country  Population
0  North America   United States   331002651
1         Europe         Germany    83783942
2           Asia           China  1439323776
3  North America          Canada    37742154
4           Asia           Japan   126476461
5         Europe          France    65273511
6  North America          Mexico   128932753
7           Asia           India  1380004385
8         Europe  United Kingdom    67886011
9           Asia           Nepal    29136808

In [37]:
df.head()

       Continent        Country  Population
0  North America  United States   331002651
1         Europe        Germany    83783942
2           Asia          China  1439323776
3  North America         Canada    37742154
4           Asia          Japan   126476461

In [38]:
df.tail()

       Continent         Country  Population
5         Europe          France    65273511
6  North America          Mexico   128932753
7           Asia           India  1380004385
8         Europe  United Kingdom    67886011
9           Asia           Nepal    29136808

# sort value

In [39]:
df.sort_values("Country")

       Continent         Country  Population
3  North America          Canada    37742154
2           Asia           China  1439323776
5         Europe          France    65273511
1         Europe         Germany    83783942
7           Asia           India  1380004385
4           Asia           Japan   126476461
6  North America          Mexico   128932753
9           Asia           Nepal    29136808
8         Europe  United Kingdom    67886011
0  North America   United States   331002651

In [40]:
df.set_index(["Continent","Country"])

                              Population
Continent     Country
North America United States    331002651
Europe        Germany           83783942
Asia          China           1439323776
North America Canada            37742154
Asia          Japan            126476461
Europe        France            65273511
North America Mexico           128932753
Asia          India           1380004385
Europe        United Kingdom    67886011
Asia          Nepal             29136808

In [41]:
df.iloc[3:]

       Continent         Country  Population
3  North America          Canada    37742154
4           Asia           Japan   126476461
5         Europe          France    65273511
6  North America          Mexico   128932753
7           Asia           India  1380004385
8         Europe  United Kingdom    67886011
9           Asia           Nepal    29136808

# pivot,pivot table

In [42]:
df1 = df.pivot(index="Continent",columns="Country",values = "Population")
df1

Country,Canada,China,France,Germany,India,Japan,Mexico,Nepal,United Kingdom,United States
Continent,,,,,,,,,,
Asia,NaN,1.439324e+09,NaN,NaN,1.380004e+09,126476461.0,NaN,29136808.0,NaN,NaN
Europe,NaN,NaN,65273511.0,83783942.0,NaN,NaN,NaN,NaN,67886011.0,NaN
North America,37742154.0,NaN,NaN,NaN,NaN,NaN,128932753.0,NaN,NaN,331002651.0

In [43]:
df2=df.pivot_table(index="Continent",columns="Country",values = "Population")
print(df2)

Country            Canada         China      France     Germany         India  \
Continent
Asia                  NaN  1.439324e+09         NaN         NaN  1.380004e+09
Europe                NaN           NaN  65273511.0  83783942.0           NaN
North America  37742154.0           NaN         NaN         NaN           NaN

Country              Japan       Mexico       Nepal  United Kingdom  \
Continent
Asia           126476461.0          NaN  29136808.0             NaN
Europe                 NaN          NaN         NaN      67886011.0
North America          NaN  128932753.0         NaN             NaN

Country        United States
Continent
Asia                     NaN
Europe                   NaN
North America    331002651.0

# stack,unstack

In [44]:
df.stack()

0  Continent      North America
   Country        United States
   Population         331002651
1  Continent             Europe
   Country              Germany
   Population          83783942
2  Continent               Asia
   Country                China
   Population        1439323776
3  Continent      North America
   Country               Canada
   Population          37742154
4  Continent               Asia
   Country                Japan
   Population         126476461
5  Continent             Europe
   Country               France
   Population          65273511
6  Continent      North America
   Country               Mexico
   Population         128932753
7  Continent               Asia
   Country                India
   Population        1380004385
8  Continent             Europe
   Country       United Kingdom
   Population          67886011
9  Continent               Asia
   Country                Nepal
   Population          29136808
dtype: object

In [45]:
df.unstack()

Continent   0     North America
            1            Europe
            2              Asia
            3     North America
            4              Asia
            5            Europe
            6     North America
            7              Asia
            8            Europe
            9              Asia
Country     0     United States
            1           Germany
            2             China
            3            Canada
            4             Japan
            5            France
            6            Mexico
            7             India
            8    United Kingdom
            9             Nepal
Population  0         331002651
            1          83783942
            2        1439323776
            3          37742154
            4         126476461
            5          65273511
            6         128932753
            7        1380004385
            8          67886011
            9          29136808
dtype: object

In [46]:
df.melt()

      variable           value
0    Continent   North America
1    Continent          Europe
2    Continent            Asia
3    Continent   North America
4    Continent            Asia
5    Continent          Europe
6    Continent   North America
7    Continent            Asia
8    Continent          Europe
9    Continent            Asia
10     Country   United States
11     Country         Germany
12     Country           China
13     Country          Canada
14     Country           Japan
15     Country          France
16     Country          Mexico
17     Country           India
18     Country  United Kingdom
19     Country           Nepal
20  Population       331002651
21  Population        83783942
22  Population      1439323776
23  Population        37742154
24  Population       126476461
25  Population        65273511
26  Population       128932753
27  Population      1380004385
28  Population        67886011
29  Population        29136808

In [47]:
data = {
    "Continent": ["North America", "Europe", "Asia", "North America", "Asia", "Europe", "North America", "Asia", "Europe", "Asia"],
    "Country": ["United States", "Germany", "China", "Canada", "Japan", "France", "Mexico", "India", "United Kingdom", "Nepal"],
    "Population": [331002651, 83783942, 1439323776, 37742154, 126476461, 65273511, 128932753, 1380004385, 67886011, 29136808]
}
df = pd.DataFrame(data)
df

       Continent         Country  Population
0  North America   United States   331002651
1         Europe         Germany    83783942
2           Asia           China  1439323776
3  North America          Canada    37742154
4           Asia           Japan   126476461
5         Europe          France    65273511
6  North America          Mexico   128932753
7           Asia           India  1380004385
8         Europe  United Kingdom    67886011
9           Asia           Nepal    29136808

# duplicate and removal

In [48]:
print(df.duplicated(subset=["Country"]))

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [49]:
df.drop_duplicates(subset="Country")

       Continent         Country  Population
0  North America   United States   331002651
1         Europe         Germany    83783942
2           Asia           China  1439323776
3  North America          Canada    37742154
4           Asia           Japan   126476461
5         Europe          France    65273511
6  North America          Mexico   128932753
7           Asia           India  1380004385
8         Europe  United Kingdom    67886011
9           Asia           Nepal    29136808